## Plan for terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                              |
|----------|---------------------------------------------------------------|
| update   | `module.share_files_securely_lambda.aws_lambda_function.this` |
| recreate | `aws_rds_cluster.share_files_securely`                        |
|          | `aws_rds_cluster_instance.share_files_securely`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_rds_cluster.share_files_securely must be replaced
-/+ resource "aws_rds_cluster" "share_files_securely" {
      ~ allocated_storage                   = 1 -> (known after apply)
      + apply_immediately                   = (known after apply)
      ~ arn                                 = "arn:aws:rds:ca-central-1:283582579564:cluster:share-files-securely" -> (known after apply)
      ~ availability_zones                  = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      - backtrack_window                    = 0 -> null
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [
          - "tf-20220708133628162500000001",
        ] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-2RAU7W6IW4SZLFRN7P5WECXSJY" -> (known after apply)
      - db_cluster_instance_class           = "" -> null
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql13" -> (known after apply)
      ~ db_system_id                        = "" -> (known after apply)
      - deletion_protection                 = false -> null
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "share-files-securely.cluster-cdxmw3bs3xsi.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual               = "13.8" -> (known after apply)
      - global_cluster_identifier           = "" -> null
      ~ hosted_zone_id                      = "Z1JG78A3UK1DU3" -> (known after apply)
      - iam_database_authentication_enabled = false -> null
      ~ iam_roles                           = [] -> (known after apply)
      ~ id                                  = "share-files-securely" -> (known after apply)
      - iops                                = 0 -> null
      ~ kms_key_id                          = "" -> (known after apply)
      ~ master_user_secret                  = [] -> (known after apply)
      + master_user_secret_kms_key_id       = (known after apply)
      ~ network_type                        = "IPV4" -> (known after apply)
      ~ port                                = 5432 -> (known after apply)
      ~ preferred_backup_window             = "08:25-08:55" -> (known after apply)
      ~ preferred_maintenance_window        = "thu:03:29-thu:03:59" -> (known after apply)
      ~ reader_endpoint                     = "share-files-securely.cluster-ro-cdxmw3bs3xsi.ca-central-1.rds.amazonaws.com" -> (known after apply)
      - replication_source_identifier       = "" -> null
      ~ storage_encrypted                   = false -> true # forces replacement
      ~ storage_type                        = "" -> (known after apply)
      - tags                                = {} -> null
      ~ tags_all                            = {} -> (known after apply)
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_rds_cluster_instance.share_files_securely must be replaced
-/+ resource "aws_rds_cluster_instance" "share_files_securely" {
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:ca-central-1:283582579564:db:tf-20220708133628162500000001" -> (known after apply)
      ~ availability_zone                     = "ca-central-1d" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      ~ cluster_identifier                    = "share-files-securely" -> (known after apply) # forces replacement
      ~ db_parameter_group_name               = "default.aurora-postgresql13" -> (known after apply)
      ~ db_subnet_group_name                  = "share-files-securely-subnet-group" -> (known after apply)
      ~ dbi_resource_id                       = "db-4LX34VEFAJCX4R36ZZQNB5SEWA" -> (known after apply)
      ~ endpoint                              = "tf-20220708133628162500000001.cdxmw3bs3xsi.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual                 = "13.8" -> (known after apply)
      ~ id                                    = "tf-20220708133628162500000001" -> (known after apply)
      ~ identifier                            = "tf-20220708133628162500000001" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      + kms_key_id                            = (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ performance_insights_enabled          = false -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ preferred_backup_window               = "08:25-08:55" -> (known after apply)
      ~ preferred_maintenance_window          = "wed:08:28-wed:08:58" -> (known after apply)
      ~ storage_encrypted                     = false -> (known after apply)
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      ~ writer                                = true -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.share_files_securely_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - handler                        = "" -> null
        id                             = "share_files_securely"
      - kms_key_arn                    = "" -> null
      - runtime                        = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {
            "CostCentre" = "share-files-securely"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "APP_URL"       = "https://share-files.cdssandbox.xyz"
              - "AWS_S3_BUCKET" = "share-files-securely"
              - "DB_CONNECTION" = "postgres"
              - "DB_DATABASE"   = "share_files_securely"
              - "DB_HOST"       = "share-files-securely.cluster-cdxmw3bs3xsi.ca-central-1.rds.amazonaws.com"
              - "DB_PASSWORD"   = (sensitive)
              - "DB_PORT"       = "5432"
              - "DB_USERNAME"   = "share_files"
            } -> (known after apply)
        }



        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.share_files_securely_bucket.aws_s3_bucket.this,
  on .terraform/modules/share_files_securely_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 11 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.share_files_securely"]

23 tests, 17 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
